Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS60/include/pic32cm1216ls60048.h
/** \addtogroup PIC32CM1216LS60048_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CM1216LS60048                          */
/* ************************************************************************** */
#define ID_PAC           (  0) /**< \brief Instance index for PAC (PAC) */
#define ID_PM            (  1) /**< \brief Instance index for PM (PM) */
#define ID_MCLK          (  2) /**< \brief Instance index for MCLK (MCLK) */
#define ID_RSTC          (  3) /**< \brief Instance index for RSTC (RSTC) */
#define ID_OSCCTRL       (  4) /**< \brief Instance index for OSCCTRL (OSCCTRL) */
#define ID_OSC32KCTRL    (  5) /**< \brief Instance index for OSC32KCTRL (OSC32KCTRL) */
#define ID_SUPC          (  6) /**< \brief Instance index for SUPC (SUPC) */
#define ID_GCLK          (  7) /**< \brief Instance index for GCLK (GCLK) */
#define ID_WDT           (  8) /**< \brief Instance index for WDT (WDT) */
#define ID_RTC           (  9) /**< \brief Instance index for RTC (RTC) */
#define ID_EIC           ( 10) /**< \brief Instance index for EIC (EIC) */
#define ID_FREQM         ( 11) /**< \brief Instance index for FREQM (FREQM) */
#define ID_PORT          ( 12) /**< \brief Instance index for PORT (PORT) */
#define ID_AC            ( 13) /**< \brief Instance index for AC (AC) */
#define ID_IDAU          ( 32) /**< \brief Instance index for IDAU (IDAU) */
#define ID_DSU           ( 33) /**< \brief Instance index for DSU (DSU) */
#define ID_NVMCTRL       ( 34) /**< \brief Instance index for NVMCTRL (NVMCTRL) */
#define ID_DMAC          ( 35) /**< \brief Instance index for DMAC (DMAC) */
#define ID_USB           ( 37) /**< \brief Instance index for USB (USB) */
#define ID_EVSYS         ( 64) /**< \brief Instance index for EVSYS (EVSYS) */
#define ID_SERCOM0       ( 65) /**< \brief Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       ( 66) /**< \brief Instance index for SERCOM1 (SERCOM1) */
#define ID_SERCOM2       ( 67) /**< \brief Instance index for SERCOM2 (SERCOM2) */
#define ID_SERCOM3       ( 68) /**< \brief Instance index for SERCOM3 (SERCOM3) */
#define ID_SERCOM4       ( 69) /**< \brief Instance index for SERCOM4 (SERCOM4) */
#define ID_SERCOM5       ( 70) /**< \brief Instance index for SERCOM5 (SERCOM5) */
#define ID_TC0           ( 71) /**< \brief Instance index for TC0 (TC0) */
#define ID_TC1           ( 72) /**< \brief Instance index for TC1 (TC1) */
#define ID_TC2           ( 73) /**< \brief Instance index for TC2 (TC2) */
#define ID_TCC0          ( 74) /**< \brief Instance index for TCC0 (TCC0) */
#define ID_TCC1          ( 75) /**< \brief Instance index for TCC1 (TCC1) */
#define ID_TCC2          ( 76) /**< \brief Instance index for TCC2 (TCC2) */
#define ID_TCC3          ( 77) /**< \brief Instance index for TCC3 (TCC3) */
#define ID_ADC           ( 78) /**< \brief Instance index for ADC (ADC) */
#define ID_DAC           ( 79) /**< \brief Instance index for DAC (DAC) */
#define ID_PTC           ( 80) /**< \brief Instance index for PTC (PTC) */
#define ID_TRNG          ( 81) /**< \brief Instance index for TRNG (TRNG) */
#define ID_CCL           ( 82) /**< \brief Instance index for CCL (CCL) */
#define ID_I2S           ( 83) /**< \brief Instance index for I2S (I2S) */
#define ID_OPAMP         ( 84) /**< \brief Instance index for OPAMP (OPAMP) */
#define ID_TRAM          ( 85) /**< \brief Instance index for TRAM (TRAM) */

#define ID_PERIPH_MAX    ( 85) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup PIC32CM1216LS60048_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CM1216LS60048            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x40003400)                 /**< \brief AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x42003800)                /**< \brief ADC Registers Address        */
#define CCL_REGS                         ((ccl_registers_t*)0x42004800)                /**< \brief CCL Registers Address        */
#define DAC_REGS                         ((dac_registers_t*)0x42003c00)                /**< \brief DAC Registers Address        */
#define DMAC_REGS                        ((dmac_registers_t*)0x41006000)               /**< \brief DMAC Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x41002000)                /**< \brief DSU Registers Address        */
#define DSU_EXT_REGS                     ((dsu_registers_t*)0x41002100)                /**< \brief DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40002800)                /**< \brief EIC Registers Address        */
#define EIC_SEC_REGS                     ((eic_registers_t*)0x40002a00)                /**< \brief EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x42000000)              /**< \brief EVSYS Registers Address      */
#define EVSYS_SEC_REGS                   ((evsys_registers_t*)0x42000200)              /**< \brief EVSYS Registers Address      */
#define FREQM_REGS                       ((freqm_registers_t*)0x40002c00)              /**< \brief FREQM Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x40001c00)               /**< \brief GCLK Registers Address       */
#define I2S_REGS                         ((i2s_registers_t*)0x42004c00)                /**< \brief I2S Registers Address        */
#define IDAU_REGS                        ((idau_registers_t*)0x41000000)               /**< \brief IDAU Registers Address       */
#define MCLK_REGS                        ((mclk_registers_t*)0x40000800)               /**< \brief MCLK Registers Address       */
#define NVMCTRL_REGS                     ((nvmctrl_registers_t*)0x41004000)            /**< \brief NVMCTRL Registers Address    */
#define NVMCTRL_SEC_REGS                 ((nvmctrl_registers_t*)0x41005000)            /**< \brief NVMCTRL Registers Address    */
#define OPAMP_REGS                       ((opamp_registers_t*)0x42005000)              /**< \brief OPAMP Registers Address      */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x40001400)         /**< \brief OSC32KCTRL Registers Address */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x40001000)            /**< \brief OSCCTRL Registers Address    */
#define PAC_REGS                         ((pac_registers_t*)0x40000000)                /**< \brief PAC Registers Address        */
#define PAC_SEC_REGS                     ((pac_registers_t*)0x40000200)                /**< \brief PAC Registers Address        */
#define PM_REGS                          ((pm_registers_t*)0x40000400)                 /**< \brief PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x40003000)               /**< \brief PORT Registers Address       */
#define PORT_SEC_REGS                    ((port_registers_t*)0x40003200)               /**< \brief PORT Registers Address       */
#define PORT_IOBUS_REGS                  ((port_registers_t*)0x60000000)               /**< \brief PORT Registers Address       */
#define PORT_IOBUS_SEC_REGS              ((port_registers_t*)0x60000200)               /**< \brief PORT Registers Address       */
#define PTC_REGS                         ((ptc_registers_t*)0x42004000)                /**< \brief PTC Registers Address        */
#define RSTC_REGS                        ((rstc_registers_t*)0x40000c00)               /**< \brief RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x40002400)                /**< \brief RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x42000400)             /**< \brief SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x42000800)             /**< \brief SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42000c00)             /**< \brief SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x42001000)             /**< \brief SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x42001400)             /**< \brief SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x42001800)             /**< \brief SERCOM5 Registers Address    */
#define SUPC_REGS                        ((supc_registers_t*)0x40001800)               /**< \brief SUPC Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0x42001c00)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x42002000)                 /**< \brief TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x42002400)                 /**< \brief TC2 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x42002800)                /**< \brief TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x42002c00)                /**< \brief TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x42003000)                /**< \brief TCC2 Registers Address       */
#define TCC3_REGS                        ((tcc_registers_t*)0x42003400)                /**< \brief TCC3 Registers Address       */
#define TRAM_REGS                        ((tram_registers_t*)0x42005400)               /**< \brief TRAM Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0x42004400)               /**< \brief TRNG Registers Address       */
#define USB_REGS                         ((usb_registers_t*)0x4100a000)                /**< \brief USB Registers Address        */
#define WDT_REGS                         ((wdt_registers_t*)0x40002000)                /**< \brief WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup PIC32CM1216LS60048_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CM1216LS60048                          */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UL_(0x40003400)                              /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UL_(0x42003800)                              /* ADC Base Address */
#define CCL_BASE_ADDRESS                 _UL_(0x42004800)                              /* CCL Base Address */
#define DAC_BASE_ADDRESS                 _UL_(0x42003c00)                              /* DAC Base Address */
#define DMAC_BASE_ADDRESS                _UL_(0x41006000)                              /* DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UL_(0x41002000)                              /* DSU Base Address */
#define DSU_EXT_BASE_ADDRESS             _UL_(0x41002100)                              /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UL_(0x40002800)                              /* EIC Base Address */
#define EIC_SEC_BASE_ADDRESS             _UL_(0x40002a00)                              /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UL_(0x42000000)                              /* EVSYS Base Address */
#define EVSYS_SEC_BASE_ADDRESS           _UL_(0x42000200)                              /* EVSYS Base Address */
#define FREQM_BASE_ADDRESS               _UL_(0x40002c00)                              /* FREQM Base Address */
#define GCLK_BASE_ADDRESS                _UL_(0x40001c00)                              /* GCLK Base Address */
#define I2S_BASE_ADDRESS                 _UL_(0x42004c00)                              /* I2S Base Address */
#define IDAU_BASE_ADDRESS                _UL_(0x41000000)                              /* IDAU Base Address */
#define MCLK_BASE_ADDRESS                _UL_(0x40000800)                              /* MCLK Base Address */
#define NVMCTRL_BASE_ADDRESS             _UL_(0x41004000)                              /* NVMCTRL Base Address */
#define NVMCTRL_SEC_BASE_ADDRESS         _UL_(0x41005000)                              /* NVMCTRL Base Address */
#define OPAMP_BASE_ADDRESS               _UL_(0x42005000)                              /* OPAMP Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UL_(0x40001400)                              /* OSC32KCTRL Base Address */
#define OSCCTRL_BASE_ADDRESS             _UL_(0x40001000)                              /* OSCCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UL_(0x40000000)                              /* PAC Base Address */
#define PAC_SEC_BASE_ADDRESS             _UL_(0x40000200)                              /* PAC Base Address */
#define PM_BASE_ADDRESS                  _UL_(0x40000400)                              /* PM Base Address */
#define PORT_BASE_ADDRESS                _UL_(0x40003000)                              /* PORT Base Address */
#define PORT_SEC_BASE_ADDRESS            _UL_(0x40003200)                              /* PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UL_(0x60000000)                              /* PORT Base Address */
#define PORT_IOBUS_SEC_BASE_ADDRESS      _UL_(0x60000200)                              /* PORT Base Address */
#define PTC_BASE_ADDRESS                 _UL_(0x42004000)                              /* PTC Base Address */
#define RSTC_BASE_ADDRESS                _UL_(0x40000c00)                              /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x40002400)                              /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UL_(0x42000400)                              /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UL_(0x42000800)                              /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UL_(0x42000c00)                              /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UL_(0x42001000)                              /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UL_(0x42001400)                              /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UL_(0x42001800)                              /* SERCOM5 Base Address */
#define SUPC_BASE_ADDRESS                _UL_(0x40001800)                              /* SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x42001c00)                              /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x42002000)                              /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UL_(0x42002400)                              /* TC2 Base Address */
#define TCC0_BASE_ADDRESS                _UL_(0x42002800)                              /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UL_(0x42002c00)                              /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UL_(0x42003000)                              /* TCC2 Base Address */
#define TCC3_BASE_ADDRESS                _UL_(0x42003400)                              /* TCC3 Base Address */
#define TRAM_BASE_ADDRESS                _UL_(0x42005400)                              /* TRAM Base Address */
#define TRNG_BASE_ADDRESS                _UL_(0x42004400)                              /* TRNG Base Address */
#define USB_BASE_ADDRESS                 _UL_(0x4100a000)                              /* USB Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x40002000)                              /* WDT Base Address */
/** @}  end of Peripheral Base Address Definitions */

